# Настройки генерации данных
DATA_GENERATION_CONFIG = {
    "users_count": 500,          # Количество пользователей
    "products_count": 800,      # Количество товаров
    "orders_count": 3000,         # Количество заказов
    "order_details_min": 1,      # Минимальное количество товаров в заказе
    "order_details_max": 15,     # Максимальное количество товаров в заказе
    "reviews_count": 2000,       # Максимальное количество отзывов
    "loyalty_points_count": 3000 # Максимальное количество начислений бонусных баллов
}
